{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null], "dtype": "string", "sparse": false, "ragged": false, "name": "text"}, "name": "text", "inbound_nodes": []}, {"class_name": "KerasLayer", "config": {"name": "preprocessing", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/bert_en_uncased_preprocess/3"}, "name": "preprocessing", "inbound_nodes": [[["text", 0, 0, {}]]]}, {"class_name": "KerasLayer", "config": {"name": "BERT_encoder", "trainable": true, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/small_bert/bert_en_uncased_L-2_H-128_A-2/1"}, "name": "BERT_encoder", "inbound_nodes": [{"input_word_ids": ["preprocessing", 0, 2, {}], "input_mask": ["preprocessing", 0, 0, {}], "input_type_ids": ["preprocessing", 0, 1, {}]}]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["BERT_encoder", 0, 3, {}]]]}, {"class_name": "Dense", "config": {"name": "classifier", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "classifier", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["text", 0, 0]], "output_layers": [["classifier", 0, 0]]}, "keras_version": "2.11.0", "backend": "tensorflow"}